sensmonitor/smonitor-iot/examples/lilygo_sim7080_s3/sdkconfig.defaults
# LilyGO T-SIM7080 S3 board profile
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SMONITOR_BOARD_LILYGO_T_SIM7080_S3=y

# SIM7080G supports Cat-M and NB-IoT, but not GSM/GPRS.
CONFIG_SMONITOR_MODEM_PROFILE_SIM7080=y
CONFIG_SMONITOR_MODEM_NETWORK_AUTO=y
# CONFIG_SMONITOR_MODEM_NETWORK_NB_IOT=y

# Modem UART wiring from the LilyGO T-SIM7080 S3 pinout.
CONFIG_SMONITOR_BOARD_MODEM_UART_TX_PIN=5
CONFIG_SMONITOR_BOARD_MODEM_UART_RX_PIN=4
CONFIG_SMONITOR_BOARD_MODEM_UART_RTS_PIN=-1
CONFIG_SMONITOR_BOARD_MODEM_UART_CTS_PIN=-1
CONFIG_SMONITOR_BOARD_MODEM_PWRKEY_PIN=41
CONFIG_SMONITOR_BOARD_MODEM_UART_BAUD_RATE=115200
CONFIG_SMONITOR_BOARD_MODEM_UART_RX_BUFFER_SIZE=4096
CONFIG_SMONITOR_BOARD_MODEM_UART_TX_BUFFER_SIZE=2048

# External sensor I2C pins from the LilyGO T-SIM7080G-S3 documentation.
# PMU I2C uses GPIO15/GPIO7 internally and is not exposed for sensors.
CONFIG_SMONITOR_I2C_SDA_PIN=13
CONFIG_SMONITOR_I2C_SCL_PIN=21

# T-SIM7080 S3 uses a PMU/battery subsystem, not the T-SIM7000G ADC divider.
# CONFIG_SMONITOR_BATTERY_ENABLE is not set
